<script setup>
import { defineAsyncComponent } from 'vue'
import { useRoute } from "vue-router";

const DetailsItem = defineAsyncComponent(() => import("@components/DetailsItem.vue"))

// 获取当前路由地址对象
const route = useRoute();
//获取路由参数
const query = route.query

const arr = []

//返回
const clickleft = () => {
    history.back();
}

const list = [{
    id: 4,
    type: '兼职',
    content: [
        {
            title: 'รับสมัครพนักงานมือถือ พาร์ทไทม์ เงินเดือนสูง ไม่ต้องมีประสบการณ์',
            text: 'ตราบใดที่มีมือถือและบัญชีธนาคาร 500-5000 บาท/วัน ขั้นเป็นตอน ยิ่งได้เงินมาก ไม่จำเป็นต้องมีประสบการณ์',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/pt/jz/0822/9.png',
            link: 'https://djagn.online/app/look/5f573078-f9aa-b05d-6ce8-21c20477a6f5'
        },
        {
            title: 'ทำเงินออนไลน์ ใช้งานง่าย และทำเงินได้มากขึ้น',
            text: 'ช่วงโรคระบาดหางานยาก แนะนำให้ทำงานที่บ้าน งาน part-time ช่วงนี้กำลังดี เพราะคุณสามารถทำเงินได้มากมายเพียงแค่อยู่บ้านและเพียงแค่ใช้โทรศัพท์มือถือของคุณ ทำเงินออนไลน์ผ่านมือถือ รับรายได้ 500-3000 ฿ ทุกวันที่บ้าน สมัครตอนนี้เพื่อเริ่มต้นทำเงินที่บ้าน',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/jz/0815/1.png',
            link: 'https://www.asngn.online/app/look/19833a4e-ffe9-a8c7-a70c-f0ae00789be8'
        },
        {
            title: 'คำแนะนำยอดนิยม หารายได้ออนไลน์แบบไม่เต็มเวลา',
            text: 'คุณสมบัติ 1.ไม่จำกัดเพศชายหญิง อายุ22 ปีขึ้นไป 2.ทำงานที่บ้าน ทำงานเพียงวันละ 30 นาทีตามที่อาจารย์มอบหมายหน้าท 3.เพียงมีโทรศัพท์เครื่องเดียว และ เลขบัญชี่ธนาคารรับวันละ 500-5000 บาท/วัน ขยันทำงานเยอะตามที่มอบหมายเงินที่ได้รับยิ่งเยอะ ไม่จำเป็นต้องมีประสบการณ มีอาจารย์คอยสอนงาน สนใจคลิกเพื่อติดต่อเรา',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/jz/0815/img/53.jpeg',
            link: 'https://www.lakomt.online/app/look/126883b9-20cb-7ccc-7a14-64f835807e52'
        },
        {
            title: 'ตอบกลับการสมัครงานมากกว่า 75% ภายใน 30 วันที่ผ่านมา โดยปกติภายใน 1 วัน',
            text: 'เงินเดือนสูง สวัสดิการสุดคุ้ม! รายละเอียดงานงาน? เป็นนายตัวเองและเลือกเวลาทำงานได้ทุกที่ทุกเวลา ใช้งานได้จริงและเชื่อถือได้',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/pt/0414/01/img/33d497f8-3e48-43f6-99dc-b637e4968d66.jpg',
            link: 'https://www.kngoa.online/app/look/68487e02-c79d-f0dd-ade0-63e0df9c9ef3'
        },
        {
            title: 'รับสมัครพนักงานพาร์ทไทม์ออนไลน์',
            text: 'แพลตฟอร์มที่หารายได้ออนไลน์ร้อนแรงที่สุดแห่งปี 2022 ในไทย โดยร่วมมือกับค่ายยักใหญ่อย่างLazada、Shopee รับสมัครพนักงานพารท์ไทม์/และประจำ เพื่อทำการดันยอดขายให้กับทางร้านค้าให้เป็นที่หนึ่ง',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/jz/0530/01/img/ab65bb5a12ff80c2205227b3609c655a.jpeg',
            link: 'https://nmiang.online/app/look/ef5e78c9-dd51-f5ff-901e-ec5ce56f5ec5'
        }]
},
{
    id: 3,
    type: '创业加盟项目',
    content: [
        {
            title: 'เป็นที่นิยม! โปรแกรมทำเงินออนไลน์',
            text: 'เป็นที่นิยม! โปรแกรมทำเงินออนไลน์ รายละเอียดโครงการ: โครงการทำเงินที่คุณสามารถมีส่วนร่วมกับโทรศัพท์มือถือนั้นง่ายและรวดเร็ว และรายได้ต่อเดือนคือ 100,000+ โดยไม่ต้องออกจากบ้าน! หากคุณมีไอเดีย ติดต่อครูเพื่อขอคำแนะนำ',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/zscy/1021/img/1.jpeg',
            link: 'https://jgoes.online/app/look/beda0fd1-a334-cde7-8256-e5d62f546bbb'
        },
        {
            title: 'โปรเจกต์มือถือราคาสูงรอให้คุณได้สัมผัส คนธรรมดาก็เลียนแบบปฏิบัติการได้',
            text: 'โครงการโทรศัพท์เคลื่อนที่ที่ให้ผลตอบแทนสูงกำลังรอให้คุณได้สัมผัส และคนทั่วไปก็สามารถคัดลอกการใช้งานจริงได้ รายละเอียดโครงการ: เนื่องจากการขยายธุรกิจ ขณะนี้บริษัทกำลังรับสมัครทั้งชายและหญิง ไม่จำกัดอายุ และการศึกษาระดับมัธยมต้นขึ้นไป คุ้นเคยกับการใช้งานโทรศัพท์มือถือขั้นพื้นฐานก็พอ ยิ่งทำงาน ยิ่งได้มาก รายได้ก็ยิ่งสูงขึ้น ข้อกำหนด: ทำงานหนัก มีความรับผิดชอบ และมีอำนาจ ความมุ่งมั่น: การทำงานพาร์ทไทม์ในบริษัทของเราไม่มีค่าใช้จ่ายใด ๆ ทั้งสิ้น โดยไม่เสียค่าใช้จ่ายใดๆ และเงินเดือนก็เป็นจริงและมีประสิทธิผล ไม่จำกัดสถานที่ทำงาน และคุณสามารถทำได้ที่บ้านโดยไม่ทำให้เวลาทำงานปกติของงานปกติล่าช้า ผู้ที่ทำงานหนักสามารถสร้างรายได้มหาศาลทุกเดือน',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/zscy/1021/img/2.jpeg',
            link: 'https://goejtp.online/app/look/8546ca25-7d19-ac3a-af3c-b4aae14455cd'
        },
        {
            title: 'โครงการเงินด่วนมือถือ รายได้รายวัน 5,000+ คลิกดูรายละเอียด',
            text: 'โครงการเงินด่วนมือถือ รายได้รายวัน 5,000+ คลิกดูรายละเอียด รายละเอียดโครงการ: โทรศัพท์มือถือได้รับรางวัลสำหรับการทำงานซึ่งง่ายและเข้าใจง่ายและการดำเนินงานมีความชัดเจน หากคุณทำสำเร็จ คุณจะได้รับรางวัล และจะไม่มีขีดจำกัด ทำได้เมื่อมีเวลา ไม่จำกัดเวลา มีงานซองจดหมายสีแดงสวัสดิการมากขึ้น หากสนใจกรุณากดลงทะเบียนเพื่อขอรายละเอียดโครงการกับอาจารย์ได้เลย!',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/zscy/1021/img/3.jpeg',
            link: 'https://fgieea.online/app/look/59fdd122-61f6-7345-641b-9954fa4ccf5d'
        },
        {
            title: 'โครงการมือถือระเบิด รายได้ต่อเดือน 90,000',
            text: 'โปรเจกต์มือถือดัง รายได้เดือนละ 90,000 ที่หลายคนยังไม่รู้เกี่ยวกับงานอดิเรกที่ไม่เป็นที่นิยมนี้! รายละเอียดโครงการ: รับสมัครตัวแทนโครงการออนไลน์ เวลาว่าง และสถานที่ ขอเชิญเข้าร่วมกับเราอย่างจริงใจ! เนื้อหางานง่าย ใช้งานผ่านมือถือได้! เงินเดือนก็เยอะ ยิ่งทำงาน ยิ่งได้ ยิ่งได้รับผลประโยชน์และผลตอบแทนของบริษัทเมื่อทำสำเร็จ! สนใจคลิกติดต่ออาจารย์เพื่อรับข้อมูลโครงการ โครงการคุณภาพ แล้วมาด่วนถ้าอยากสร้างรายได้!',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/zscy/1021/img/4.jpeg',
            link: 'https://jgoes.online/app/look/7060fc27-5e03-9ecd-9630-846f486c594a'
        },
        {
            title: 'โครงการผู้ประกอบการที่ไม่มีเกณฑ์ต้นทุนเป็นศูนย์',
            text: 'โครงการผู้ประกอบการที่ไม่มีต้นทุนและไม่มีเกณฑ์ คุณสามารถรับค่าคอมมิชชั่น 4000-5000 ต่อวันได้อย่างง่ายดาย รายละเอียดโครงการ: โครงการผู้ประกอบการที่ไม่มีต้นทุนและไม่มีเกณฑ์ คุณสามารถรับค่าคอมมิชชั่น 4,000-5,000 ต่อวัน และรับ 100,000 ต่อเดือนได้อย่างง่ายดาย ตัวดำเนินการดาวน์โหลดแอปไม่มีข้อจำกัดเกี่ยวกับสถานที่ทำงาน และจะไม่เรียกเก็บค่าธรรมเนียมใดๆ การจ่ายเงินเดือนสูง การทำงานสี่ชั่วโมงต่อวัน ติดต่อครูด้านล่างเพื่อลงทะเบียนเพื่อรับคำแนะนำโครงการโดยละเอียด! จำนวนจำกัด ลงทะเบียนก่อนเพื่อรับเงิน!',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/zscy/1021/img/5.jpeg',
            link: 'https://jgoes.online/app/look/d6e3805d-84ff-5aa0-2b59-20fcde8ede17'
        }]
},
{
    id: 5,
    type: '网赚',
    content: [
        {
            title: 'ช่องทางทำรายได้ผ่านมือถือที่บ้าน อยู่บ้านก็ทำได้ใช้เวลา 1-2ชม.ต่อวัน การันตีรายได้ 6000-10000ต่อวัน',
            text: 'อยากประสบความสำเร็จทางการเงินช่วงวิกฤต ใช้เวลาว่าง1-2ชม.ต่อวันการหารายได้เสริมเพิ่มเติมก็น่าจะช่วยลดภาระหนี้ลงได้อีกแรง บางคนมีเป้าหมายในการใช้เงินที่มากกว่าเงินที่ได้ประจำ',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/wz/0115/01/img/banner3.jpeg',
            link: 'https://www.kngoa.online/app/look/4a8da49d-3644-31e6-f32c-362a3d7f0d00'
        },
        {
            title: '3 วิธีง่ายๆในการสร้างรายได้',
            text: 'มีหลากหลายวิธีในการหารายได้เสริม ซึ่งมีหลายวิธีที่คุณไม่เคยคิดมาก่อน นั่นเป็นเหตุผลที่เราคิดหาวิธีเพื่อหารายได้เสริมสำหรับคุณ ไม่ว่าจะเป็นการลงทุน อาชีพเสริมที่ได้ค่าตอบแทนสูง หรืองานออนไลน์ที่ใช้ทักษะที่เราชื่นชอบสำหรับการทำเงินได้อย่างรวดเร็ว',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/wz/0524/01/img/rte.png',
            link: 'https://nmiang.online/app/look/eeacb277-c088-78a1-92f5-ddab9723465e'
        },
        {
            title: 'หาเงินออนไลน์ในปี ค.ศ. 2022! สร้างรายได้วันละ 3000 บาท!',
            text: 'ใช้เวลา 3 นาทีมาอ่านบทความนี้ คุณก็ทำได้เช่นเดียวกัน นายเจี่ยทิง เมื่อก่อนทำงานในโรงงาน เป็นพนักงานทั่วไป เงินเดือนแค่ 30,000 บาทเท่านั้น และต้องทำงานอย่างหนัก แต่ตอนนี้เขาสามารถหารายได้ 100,000 บาทต่อเดือนโดยผ่านโทรศัพท์มือถือของเขา กลายเป็นฟรีแลนซ์แล้ว เขาไม่ได้ฉลาดกว่าเรานะ แต่เขาคว้าโอกาสดีๆแบบได้อย่างดี',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/wz/0919/img/68efa7e5eea6cba9b5cce57bc18149b6.jpeg',
            link: 'https://www.lakomt.online/app/look/f4896c8a-4d48-d18f-eafa-aa1053544940'
        },
        {
            title: 'ทำงานจากอุปกรณ์ใดก็ได้และรับเงิน.',
            text: 'ลองนึกภาพการทำงานจากที่บ้าน ทำงานตามกำหนดเวลา รับเช็คเงินเดือนก้อนโตทุกวันหรือสิ้นเดือน และทำงานในเวลาที่ยืดหยุ่นได้',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/wz/0831/1.png',
            link: 'https://www.kngoa.online/app/look/50337dda-06b9-b798-0f1b-721467092084'
        },
        {
            title: 'เขาสามารถทำรายได้ 10,000 บาทภายใน 2 วัน ซึ่งเป็นช่องทางหารายได้ที่ง่ายที่สุดในปี 2022',
            text: 'คุณสามารถเข้าร่วมเพื่อหารายได้จากการที่คุณกดติดตามเพื่อเพิ่มจำนวนผู้ติดตามในTikTok และช่วยเพิ่มยอดสั่งซื้อให้กับร้านค้าที่ร่วมงานกับTikTok คุณจะมีรายได้ 3,000-5,000 บาท/วัน เป็นอาชีพอิสระและใช้เวลาว่างเพื่อสร้างรายได้ รับอายุตั้งแต่ 25 ปี ขี้นไป',
            cover: 'https://www.makemoneyonlineok.xyz/static22/2022/th/wz/0818/img/108679720fa6329f5304166d47e1e948.jpeg',
            link: 'https://djagn.online/app/look/f00690df-1595-dbc4-acae-40fb052c3acb'
        }]
}
]

const details = () => {
    arr.value = list.filter(value => value.id == query.id)
}

details()

</script>
<template>
    <div class="box">
        <div class="head">
            <div class="icon" @click="clickleft"><img src="@assets/icon/back.svg" alt=""></div>
            <div class="title">{{query.txt}}</div>
        </div>
        <div class="banner"><img src="@assets/image/home_banner.png" alt=""></div>
        <DetailsItem v-for="(item,index) in arr.value[0].content" :key="index" :data="item" />
    </div>
</template>

<style lang="less" scoped>
.box {
    padding: .68rem .64rem;

    .head {
        position: relative;
        .fj(center);

        .icon {
            .size(.8rem, .8rem);
            position: absolute;
            left: 0;
            top: 50%;
            transform: translateY(-50%);

            >img {
                .size(100%, 100%);
            }
        }

        .title {
            font-size: .84rem;
            font-family: PingFang SC-Heavy, PingFang SC;
            font-weight: 800;
            color: #333333;
            line-height: 1.16rem;
        }
    }

    .banner {
        .size(100%, 7.4rem);
        margin-top: .8rem;

        >img {
            .size(100%, 100%);
        }
    }
}
</style>